# -*- mode: org; mode: auto-fill -*-
#+TITLE:	Using Org Babel for Literate Programming
#+category:	posts
#+layout:	post

Most people that have heard about Org mode are aware that
it is a tool meant for creating =TODO= lists, taking notes,
and even doing documentation to some extent.

What is not immediately clear about Org mode is that it is a very
powerful tool for doing literate programming and a comfortable
environment for working with active documents.

Rather than explain the ideas one by one, I will give a more 
practical example of what it is possible to do with it.

**** Requirements

What we want is basically the output of the following commands:

#+BEGIN_SRC sh :results output code :exports both
uptime
#+END_SRC

...which will show something like this:

#+RESULTS:
#+BEGIN_SRC sh
20:37  up 4 days,  9:48, 5 users, load averages: 0.67 0.86 1.11
#+END_SRC

And:

#+begin_src sh :results output code :exports both
netstat -an | grep ESTABLISHED | wc -l
#+end_src

which shows a number:

#+RESULTS:
#+BEGIN_SRC sh
       5
#+END_SRC

The result from both commands would be aggregated into
the response sent by the the server when we request =/vars=:

#+BEGIN_SRC sh :results output
curl 127.0.0.1:9292/vars
#+END_SRC

#+RESULTS:
: Uptime:
: 21:04  up 4 days, 10:15, 5 users, load averages: 0.29 0.39 0.48
: 
: 
: ESTABLISHED connections:
:        6
: 
: 

Result:

#+BEGIN_EXAMPLE
Uptime:

20:37  up 4 days,  9:48, 5 users, load averages: 0.67 0.86 1.11

ESTABLISHED connections: 14

#+END_EXAMPLE

